ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_lns.c
/******************************************************************************
* Function Name: Cy_BLE_LNSS_ConfirmationEventHandler
***************************************************************************//**
*
*  Handles the Value Confirmation request event from the BLE stack.
*
*  \param eventParam: Pointer to a structure of type cy_stc_ble_conn_handle_t
*
******************************************************************************/
static void Cy_BLE_LNSS_ConfirmationEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    if((Cy_BLE_LNS_ApplCallback != NULL) && (cy_ble_lnsConfigPtr->lnss->charInfo[CY_BLE_LNS_CP].charHandle ==
                                             cy_ble_lnssReqHandle))
    {
        cy_stc_ble_lns_char_value_t locCharIndex = { .connHandle = *eventParam };

        cy_ble_lnssReqHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
        cy_ble_lnsFlag &= (uint8_t) ~CY_BLE_LNS_FLAG_PROCESS;

        locCharIndex.charIndex = CY_BLE_LNS_CP;
        locCharIndex.value = NULL;

        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        Cy_BLE_LNS_ApplCallback((uint32_t)CY_BLE_EVT_LNSS_INDICATION_CONFIRMED, &locCharIndex);
    }
}


/******************************************************************************
* Function Name: Cy_BLE_LNSS_WriteEventHandler
***************************************************************************//**
*
*  Handles the Write Request Event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
* \return
*  cy_en_ble_gatt_err_code_t - A function result state if it succeeded
*  (CY_BLE_GATT_ERR_NONE) or failed with error codes:
*   * CY_BLE_GATTS_ERR_PROCEDURE_ALREADY_IN_PROGRESS
*   * CY_BLE_GATTS_ERR_CCCD_IMPROPERLY_CONFIGURED
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_LNSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;
    cy_stc_ble_lns_char_value_t locCharValue;

    if(Cy_BLE_LNS_ApplCallback != NULL)
    {
        locCharValue.connHandle = eventParam->connHandle;

        if(eventParam->handleValPair.attrHandle == cy_ble_lnsConfigPtr->lnss->charInfo[CY_BLE_LNS_CP].charHandle)
        {
            if(CY_BLE_LNS_IS_PROCEDURE_IN_PROGRESS)
            {
                gattErr = CY_BLE_GATT_ERR_PROCEDURE_ALREADY_IN_PROGRESS;
            }
            else if(!CY_BLE_IS_INDICATION_ENABLED(eventParam->connHandle.attId,
                                                  cy_ble_lnsConfigPtr->lnss->charInfo[CY_BLE_LNS_CP].
                                                   descrHandle[CY_BLE_LNS_CCCD]))
            {
                gattErr = CY_BLE_GATT_ERR_CCCD_IMPROPERLY_CONFIGURED;
            }
            else
            {
                cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                {
                    .handleValuePair = eventParam->handleValPair,
                    .connHandle      = eventParam->connHandle,
                    .offset          = 0u,
                    .flags           = CY_BLE_GATT_DB_PEER_INITIATED
                };

                gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);

                locCharValue.charIndex = CY_BLE_LNS_CP;
                locCharValue.value = &eventParam->handleValPair.value;
                if(gattErr == CY_BLE_GATT_ERR_NONE)
                {
                    Cy_BLE_LNS_ApplCallback((uint32_t)CY_BLE_EVT_LNSS_WRITE_CHAR, &locCharValue);
                    cy_ble_lnsFlag |= CY_BLE_LNS_FLAG_PROCESS;
                }
            }

            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else
        {
            for(locCharValue.charIndex = CY_BLE_LNS_LS; locCharValue.charIndex < CY_BLE_LNS_CHAR_COUNT;
                locCharValue.charIndex++)
            {
                if(locCharValue.charIndex == CY_BLE_LNS_PQ)
                {
                    locCharValue.charIndex++;
                }

                if(eventParam->handleValPair.attrHandle == cy_ble_lnsConfigPtr->lnss->charInfo[locCharValue.charIndex].
                    descrHandle[CY_BLE_LNS_CCCD])
                {
                    cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                    {
                        .handleValuePair = eventParam->handleValPair,
                        .connHandle      = eventParam->connHandle,
                        .offset          = 0u,
                        .flags           = CY_BLE_GATT_DB_PEER_INITIATED
                    };
                    gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);
                    locCharValue.value = NULL;
                    if(gattErr == CY_BLE_GATT_ERR_NONE)
                    {
                        uint32_t eventCode;

                        if(locCharValue.charIndex == CY_BLE_LNS_CP)
                        {
                            if(CY_BLE_IS_INDICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                            {
                                eventCode = (uint32_t)CY_BLE_EVT_LNSS_INDICATION_ENABLED;
                            }
                            else
                            {
                                eventCode = (uint32_t)CY_BLE_EVT_LNSS_INDICATION_DISABLED;
                            }
                        }
                        else
                        {
                            if(CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                            {
                                eventCode = (uint32_t)CY_BLE_EVT_LNSS_NOTIFICATION_ENABLED;
                            }
                            else
                            {
                                eventCode = (uint32_t)CY_BLE_EVT_LNSS_NOTIFICATION_DISABLED;
                            }
                        }

                        Cy_BLE_LNS_ApplCallback(eventCode, &locCharValue);
                    }

