ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_lns.c
/******************************************************************************
* Function Name: Cy_BLE_LNSC_NotificationEventHandler
***************************************************************************//**
*
*  Handles the Notification Event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_LNSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_LNS_ApplCallback != NULL))
    {
        cy_stc_ble_lns_char_value_t locCharValue = { .connHandle = eventParam->connHandle };

        if(cy_ble_lnsc[discIdx].charInfo[CY_BLE_LNS_LS].valueHandle == eventParam->handleValPair.attrHandle)
        {
            locCharValue.charIndex = CY_BLE_LNS_LS;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else if(cy_ble_lnsc[discIdx].charInfo[CY_BLE_LNS_NV].valueHandle == eventParam->handleValPair.attrHandle)
        {
            locCharValue.charIndex = CY_BLE_LNS_NV;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else
        {
            /* Location and Navigation Service doesn't support any other notifications */
        }

        if((cy_ble_eventHandlerFlag & CY_BLE_CALLBACK) == 0u)
        {
            locCharValue.value = &eventParam->handleValPair.value;
            Cy_BLE_LNS_ApplCallback((uint32_t)CY_BLE_EVT_LNSC_NOTIFICATION, &locCharValue);
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_LNSC_IndicationEventHandler
***************************************************************************//**
*
*  Handles the Indication Event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_LNSC_IndicationEventHandler(cy_stc_ble_gattc_handle_value_ind_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_LNS_ApplCallback != NULL))
    {
        if(cy_ble_lnsc[discIdx].charInfo[CY_BLE_LNS_CP].valueHandle == eventParam->handleValPair.attrHandle)
        {
            cy_stc_ble_lns_char_value_t locCharValue =
            {
                .charIndex  = CY_BLE_LNS_CP,
                .connHandle = eventParam->connHandle,
                .value      = &eventParam->handleValPair.value
            };
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            Cy_BLE_LNS_ApplCallback((uint32_t)CY_BLE_EVT_LNSC_INDICATION, &locCharValue);
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_LNSC_ReadResponseEventHandler
***************************************************************************//**
*
*  Handles the Read Response Event.
*
*  \param eventParam:  the pointer to the data structure.
*
******************************************************************************/
static void Cy_BLE_LNSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_LNS_ApplCallback != NULL) &&
       (cy_ble_lnscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        cy_en_ble_lns_char_index_t i;

        for(i = CY_BLE_LNS_FT; i < CY_BLE_LNS_CHAR_COUNT; i++)
        {
            if(cy_ble_lnsc[discIdx].charInfo[i].valueHandle == cy_ble_lnscReqHandle[discIdx])
            {
                cy_stc_ble_lns_char_value_t locCharValue =
                {
                    .connHandle = eventParam->connHandle,
                    .charIndex  = i,
                    .value      = &eventParam->value
                };

                cy_ble_lnscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                Cy_BLE_LNS_ApplCallback((uint32_t)CY_BLE_EVT_LNSC_READ_CHAR_RESPONSE, &locCharValue);
            }
        }

        if(0u != (cy_ble_eventHandlerFlag | CY_BLE_CALLBACK))
        {
            for(i = CY_BLE_LNS_FT; i < CY_BLE_LNS_CHAR_COUNT; i++)
            {
                if(cy_ble_lnsc[discIdx].charInfo[i].descrHandle[CY_BLE_LNS_CCCD] == cy_ble_lnscReqHandle[discIdx])
                {
                    cy_stc_ble_lns_descr_value_t locDescrValue =
                    {
                        .connHandle = eventParam->connHandle,
                        .charIndex  = i,
                        .descrIndex = CY_BLE_LNS_CCCD,
                        .value      = &eventParam->value
                    };

                    cy_ble_lnscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                    cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                    Cy_BLE_LNS_ApplCallback((uint32_t)CY_BLE_EVT_LNSC_READ_DESCR_RESPONSE, &locDescrValue);
                    break;
                }
            }
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_LNSC_WriteResponseEventHandler
***************************************************************************//**
*
*  Handles the Write Response Event.
*
*  \param eventParam: The pointer to a data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_LNSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(*eventParam);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_LNS_ApplCallback != NULL) &&
       (cy_ble_lnscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        if(cy_ble_lnsc[discIdx].charInfo[CY_BLE_LNS_CP].valueHandle == cy_ble_lnscReqHandle[discIdx])
        {
            cy_stc_ble_lns_char_value_t locCharIndex =
            {
                .connHandle = *eventParam,
                .charIndex  = CY_BLE_LNS_CP,
                .value      = NULL
            };

            cy_ble_lnscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            Cy_BLE_LNS_ApplCallback((uint32_t)CY_BLE_EVT_LNSC_WRITE_CHAR_RESPONSE, &locCharIndex);
        }
        else
        {
            cy_en_ble_lns_char_index_t i;

            for(i = CY_BLE_LNS_FT; i < CY_BLE_LNS_CHAR_COUNT; i++)
            {
                if(cy_ble_lnsc[discIdx].charInfo[i].descrHandle[CY_BLE_LNS_CCCD] == cy_ble_lnscReqHandle[discIdx])
                {
                    cy_stc_ble_lns_descr_value_t locDescIndex =
                    {
                        .connHandle = *eventParam,
                        .charIndex  = i,
                        .descrIndex = CY_BLE_LNS_CCCD,
                        .value      = NULL
                    };

                    cy_ble_lnscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                    cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                    Cy_BLE_LNS_ApplCallback((uint32_t)CY_BLE_EVT_LNSC_WRITE_DESCR_RESPONSE, &locDescIndex);
                    break;
                }
            }
        }
    }
}


